profiling/output/wrk2_tmp_put.txt
$ wrk2 -c 128 -t 8 -d 65s -R 70000 -L -s ./scripts/put.lua http://localhost:8080/ >> output/wrk2_tmp_put.txt


Running 1m test @ http://localhost:8080/
  8 threads and 128 connections
  Thread calibration: mean lat.: 1.070ms, rate sampling interval: 10ms
  Thread calibration: mean lat.: 1.119ms, rate sampling interval: 10ms
  Thread calibration: mean lat.: 1.059ms, rate sampling interval: 10ms
  Thread calibration: mean lat.: 1.177ms, rate sampling interval: 10ms
  Thread calibration: mean lat.: 1.167ms, rate sampling interval: 10ms
  Thread calibration: mean lat.: 1.075ms, rate sampling interval: 10ms
  Thread calibration: mean lat.: 1.055ms, rate sampling interval: 10ms
  Thread calibration: mean lat.: 1.134ms, rate sampling interval: 10ms
  Thread Stats   Avg      Stdev     Max   +/- Stdev
    Latency     1.03ms    1.00ms  73.79ms   96.81%
    Req/Sec     9.22k   604.43    21.20k    79.67%
  Latency Distribution (HdrHistogram - Recorded Latency)
 50.000%    0.96ms
 75.000%    1.33ms
 90.000%    1.63ms
 99.000%    2.81ms
 99.900%    6.21ms
 99.990%   47.23ms
 99.999%   59.55ms
100.000%   73.86ms

  Detailed Percentile spectrum:
       Value   Percentile   TotalCount 1/(1-Percentile)

       0.022     0.000000            2         1.00
       0.398     0.100000        98143         1.11
       0.545     0.200000       196501         1.25
       0.684     0.300000       294188         1.43
       0.824     0.400000       392461         1.67
       0.965     0.500000       490143         2.00
       1.037     0.550000       539203         2.22
       1.109     0.600000       588118         2.50
       1.183     0.650000       637679         2.86
       1.256     0.700000       686443         3.33
       1.332     0.750000       735099         4.00
       1.372     0.775000       759843         4.44
       1.413     0.800000       784230         5.00
       1.457     0.825000       808783         5.71
       1.505     0.850000       833325         6.67
       1.559     0.875000       857708         8.00
       1.591     0.887500       869992         8.89
       1.626     0.900000       882210        10.00
       1.666     0.912500       894263        11.43
       1.714     0.925000       906590        13.33
       1.773     0.937500       918765        16.00
       1.809     0.943750       925037        17.78
       1.849     0.950000       931126        20.00
       1.898     0.956250       937192        22.86
       1.959     0.962500       943272        26.67
       2.039     0.968750       949387        32.00
       2.093     0.971875       952519        35.56
       2.157     0.975000       955583        40.00
       2.235     0.978125       958599        45.71
       2.335     0.981250       961677        53.33
       2.465     0.984375       964701        64.00
       2.541     0.985938       966238        71.11
       2.635     0.987500       967788        80.00
       2.743     0.989062       969315        91.43
       2.867     0.990625       970838       106.67
       3.023     0.992188       972356       128.00
       3.123     0.992969       973125       142.22
       3.229     0.993750       973893       160.00
       3.351     0.994531       974657       182.86
       3.513     0.995313       975431       213.33
       3.715     0.996094       976184       256.00
       3.839     0.996484       976571       284.44
       3.987     0.996875       976954       320.00
       4.167     0.997266       977335       365.71
       4.399     0.997656       977721       426.67
       4.735     0.998047       978103       512.00
       4.919     0.998242       978290       568.89
       5.159     0.998437       978481       640.00
       5.415     0.998633       978674       731.43
       5.807     0.998828       978866       853.33
       6.267     0.999023       979055      1024.00
       6.779     0.999121       979151      1137.78
       7.627     0.999219       979247      1280.00
       9.295     0.999316       979343      1462.86
      12.335     0.999414       979438      1706.67
      15.911     0.999512       979534      2048.00
      19.759     0.999561       979582      2275.56
      23.679     0.999609       979630      2560.00
      27.311     0.999658       979678      2925.71
      30.943     0.999707       979725      3413.33
      34.687     0.999756       979773      4096.00
      36.575     0.999780       979797      4551.11
      38.463     0.999805       979821      5120.00
      40.287     0.999829       979845      5851.43
      42.047     0.999854       979869      6826.67
      44.031     0.999878       979893      8192.00
      45.727     0.999890       979905      9102.22
      47.455     0.999902       979917     10240.00
      49.151     0.999915       979929     11702.86
      50.847     0.999927       979941     13653.33
      52.575     0.999939       979953     16384.00
      52.895     0.999945       979959     18204.44
      54.271     0.999951       979965     20480.00
      54.591     0.999957       979971     23405.71
      55.967     0.999963       979977     27306.67
      56.255     0.999969       979983     32768.00
      56.415     0.999973       979986     36408.89
      57.567     0.999976       979989     40960.00
      57.759     0.999979       979992     46811.43
      57.919     0.999982       979995     54613.33
      59.231     0.999985       979998     65536.00
      59.263     0.999986       979999     72817.78
      59.487     0.999988       980001     81920.00
      59.551     0.999989       980003     93622.86
      59.999     0.999991       980004    109226.67
      61.791     0.999992       980005    131072.00
      63.551     0.999993       980006    145635.56
      65.343     0.999994       980007    163840.00
      65.343     0.999995       980007    187245.71
      67.135     0.999995       980008    218453.33
      68.927     0.999996       980009    262144.00
      68.927     0.999997       980009    291271.11
      70.719     0.999997       980010    327680.00
      70.719     0.999997       980010    374491.43
      70.719     0.999998       980010    436906.67
      72.383     0.999998       980011    524288.00
      72.383     0.999998       980011    582542.22
      72.383     0.999998       980011    655360.00
      72.383     0.999999       980011    748982.86
      72.383     0.999999       980011    873813.33
      73.855     0.999999       980012   1048576.00
      73.855     1.000000       980012          inf
#[Mean    =        1.035, StdDeviation   =        0.995]
#[Max     =       73.792, Total count    =       980012]
#[Buckets =           27, SubBuckets     =         2048]
----------------------------------------------------------
  1682959 requests in 24.08s, 107.53MB read
Requests/sec:  69888.93
Transfer/sec:      4.47MB